In [1]:
import pandas as pd

In [2]:
from pandas import DataFrame, Series

In [3]:
import numpy as np

In [4]:
data = Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1,2,3,1,3,1,2,2,3]])

In [5]:
data

a  1    2.177027
   2    0.590269
   3    0.679335
b  1    1.092465
   3    2.278444
c  1    0.549582
   2    0.975431
d  2   -0.888432
   3   -1.184871
dtype: float64

In [6]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
data['b']

1    1.092465
3    2.278444
dtype: float64

In [8]:
data['b':'c']

b  1    1.092465
   3    2.278444
c  1    0.549582
   2    0.975431
dtype: float64

In [10]:
data.loc[['b', 'd']]

b  1    1.092465
   3    2.278444
d  2   -0.888432
   3   -1.184871
dtype: float64

In [11]:
data.loc[:, 2]

a    0.590269
c    0.975431
d   -0.888432
dtype: float64

In [13]:
data.unstack()

          1         2         3
a  2.177027  0.590269  0.679335
b  1.092465       NaN  2.278444
c  0.549582  0.975431       NaN
d       NaN -0.888432 -1.184871

In [14]:
data.unstack().stack()

a  1    2.177027
   2    0.590269
   3    0.679335
b  1    1.092465
   3    2.278444
c  1    0.549582
   2    0.975431
d  2   -0.888432
   3   -1.184871
dtype: float64

In [15]:
frame = DataFrame(np.arange(12).reshape((4,3)), index=[['a', 'a', 'b', 'b'], [1,2,1,2]], columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [16]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11